docs/Topics/Consumerism.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-28 Sat 20:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tools I Like</title>
<meta name="author" content="Elle Najt" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Tools I Like</h1>
<div id="outline-container-orgad8f796" class="outline-2">
<h2 id="orgad8f796">Tools I love:</h2>
<div class="outline-text-2" id="text-orgad8f796">
<p>
Here are some mostly material things that have my life better:<br />
</p>
</div>
<div id="outline-container-org0ab2b1e" class="outline-3">
<h3 id="org0ab2b1e">Good ergonomics:</h3>
<div class="outline-text-3" id="text-org0ab2b1e">
<p>
This matters a lot for flow, and for finding programming <a href="Opinions.html#org95f8e44">fun</a>. Here are my favorite bits of ergonomics:<br />
</p>
<ul class="org-ul">
<li>A gas monitor arm for getting the right monitor position<br /></li>
<li>A kinesis 360 keyboard<br /></li>
<li>A herman-miller embody<br /></li>
</ul>

<p>
These can be aligned so that my whole body feels at ease when I&rsquo;m working, and it helps me stay in the zone for longer periods of time.<br />
</p>

<p>
And obviously emacs.<br />
</p>
</div>
</div>
<div id="outline-container-orga71d2e4" class="outline-3">
<h3 id="orga71d2e4">Good sleep</h3>
<div class="outline-text-3" id="text-orga71d2e4">
<ul class="org-ul">
<li>A good bed &#x2013; use the money back return offers to iterate!<br /></li>
<li>A weighted blanket<br /></li>
<li>A good air filter<br /></li>
<li>(<a href="https://slatestarcodex.com/2018/07/10/melatonin-much-more-than-you-wanted-to-know/#post-4987">The right dose of</a>) melatonin sometimes<br /></li>
<li>The right mindset: framing it as trying to rest rather than fall asleep has helped me, as described <a href="https://tasshin.com/blog/the-gospel-of-naps-according-to-tasshin/">here</a>.<br /></li>
<li>Going to bed regularly on time.<br /></li>
<li>Reading fiction in bed is really helpful for winding down in an enjoyable way.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orga7f87cb" class="outline-3">
<h3 id="orga7f87cb">Good food</h3>
<div class="outline-text-3" id="text-orga7f87cb">
<p>
These two things help me stay hydrated and eating well:<br />
</p>

<ul class="org-ul">
<li>A nutribullet Blender<br /></li>
<li>A zojirushi hot water dispenser<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org159037a" class="outline-3">
<h3 id="org159037a">Good exercise:</h3>
<div class="outline-text-3" id="text-org159037a">
<p>
I&rsquo;m liking finding opportunities to move and to push my body. Some ways that are always available:<br />
</p>

<ul class="org-ul">
<li>Dancing<br /></li>
<li>Running up stairs<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org9298e4e" class="outline-3">
<h3 id="org9298e4e">Allergy shots</h3>
<div class="outline-text-3" id="text-org9298e4e">
<p>
Having allergies sucks. Get allergy shots if you can. Some doctors offer rush shots that can move you through the early slog faster.<br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elle Najt</p>
<p class="email">Email: <a href="mailto:LNAJT4@gmail.com">LNAJT4@gmail.com</a></p>
<p class="date">Created: 2026-02-28 Sat 20:32</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
